---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallCrossSection
source: html/d35eae64-a326-fad4-fec3-46560256ee31.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallCrossSection Property

"Cross-Section"

## Syntax (C#)
```csharp
public static ForgeTypeId WallCrossSection { get; }
```